test/soap/01_815_4f397c901dddf.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><soap:Body><CreateIncompleteLotRequest xmlns="http://api.scoteid.com/api/"><ApplicationName xmlns="">iWAMS.DMS.CLIENT</ApplicationName><ApplicationVersion xmlns="">3.3.1.12</ApplicationVersion><SchemaVersion xmlns="">1.1</SchemaVersion><Timestamp xmlns="">2012-02-13T21:12:17.6613867+00:00</Timestamp><Lot xmlns=""><LotNumber>1656</LotNumber><LotDate>2012-02-08</LotDate><MovementType>8</MovementType><HeadCount>44</HeadCount><AllEID>false</AllEID><DepartureLocation>85/590/0035</DepartureLocation><ReadLocation>85/593/8000</ReadLocation><DestinationLocation>85/593/8000</DestinationLocation><TagReadings><TagReading Hex="8200CE8C2EE88EE4" Timestamp="2012-02-08T12:16:43.31" /><TagReading Hex="8200CE8C2EE8905A" Timestamp="2012-02-08T12:16:59.86" /><TagReading Hex="8200CE8C2EE89046" Timestamp="2012-02-08T12:17:25.563" /><TagReading Hex="8200CE8C2EE89035" Timestamp="2012-02-08T12:18:19.297" /><TagReading Hex="8200CE8C2EE88EE2" Timestamp="2012-02-08T12:19:11" /><TagReading Hex="8200CE8C2EE89040" Timestamp="2012-02-08T12:19:16.673" /><TagReading Hex="8200CE8C2EE8904D" Timestamp="2012-02-08T12:19:19.393" /><TagReading Hex="8200CE8C2EE8904B" Timestamp="2012-02-08T12:19:49.063" /><TagReading Hex="8200CE8C2EE8904C" Timestamp="2012-02-08T12:19:51.75" /><TagReading Hex="8200CE8C2EE89050" Timestamp="2012-02-08T12:20:30.813" /><TagReading Hex="8200CE8C2EE89052" Timestamp="2012-02-08T12:21:51.673" /><TagReading Hex="8200CE8C2EE89053" Timestamp="2012-02-08T12:21:55.363" /><TagReading Hex="8200CE8C2EE89049" Timestamp="2012-02-08T12:22:21.097" /><TagReading Hex="8200CE8C2EE89098" Timestamp="2012-02-08T12:22:44.237" /><TagReading Hex="8200CE8C2EE89056" Timestamp="2012-02-08T12:23:27.537" /><TagReading Hex="8200CE8C2EE8903F" Timestamp="2012-02-08T12:24:01.287" /><TagReading Hex="8200CE8C2EE89054" Timestamp="2012-02-08T12:25:11.897" /><TagReading Hex="8200CE8C2EE8904E" Timestamp="2012-02-08T12:26:41.727" /><TagReading Hex="8200CE8C2EE8903E" Timestamp="2012-02-08T12:26:45.443" /><TagReading Hex="8200CE8C2EE89044" Timestamp="2012-02-08T12:27:09.193" /><TagReading Hex="8200CE8C2EE8904F" Timestamp="2012-02-08T12:27:14.867" /><TagReading Hex="8200CE8C2EE8904A" Timestamp="2012-02-08T12:28:57.71" /><TagReading Hex="8200CE8C2EE89051" Timestamp="2012-02-08T12:29:46.587" /><TagReading Hex="8200CE8C2EE89043" Timestamp="2012-02-08T12:30:54.573" /><TagReading Hex="8200CE8C2EE89048" Timestamp="2012-02-08T12:31:45.433" /><TagReading Hex="8200CE8C2EE89041" Timestamp="2012-02-08T12:35:14.747" /><TagReading Hex="8200CE8C2EE8909B" Timestamp="2012-02-08T12:35:43.437" /><TagReading Hex="8200CE8C2EE89055" Timestamp="2012-02-08T12:36:11.14" /><TagReading Hex="8200CE8C2EE89047" Timestamp="2012-02-08T12:36:53.233" /><TagReading Hex="8200CE8C2EE8905B" Timestamp="2012-02-08T12:37:07.14" /><TagReading Hex="8200CE8C2EE89045" Timestamp="2012-02-08T12:38:01.75" /><TagReading Hex="8200CE8C2EE89042" Timestamp="2012-02-08T12:39:26.58" /><TagReading Hex="8200CE8C2EE89034" Timestamp="2012-02-08T12:39:58.393" /><TagReading Hex="8200CE8C2EE89057" Timestamp="2012-02-08T12:40:00.017" /><TagReading Hex="8200CE8C2EE88EE1" Timestamp="2012-02-08T12:40:16.72" /><TagReading Hex="8200CE8C2EE88EE0" Timestamp="2012-02-08T12:40:19.47" /><TagReading Hex="8200CE8C2EE89058" Timestamp="2012-02-08T12:41:24.267" /><TagReading Hex="8200CE8C2EE88EE3" Timestamp="2012-02-08T12:41:59.987" /><TagReading Hex="8200CE8C2EE89059" Timestamp="2012-02-08T12:42:53.033" /><TagReading Hex="8200CE8C2EE89099" Timestamp="2012-02-08T12:42:56.723" /><TagReading Hex="8200CE8C2EE89037" Timestamp="2012-02-08T12:43:40.52" /></TagReadings></Lot></CreateIncompleteLotRequest></soap:Body></soap:Envelope>